# d2011 = []

# Katar = ['Катар', 20, [],]
# Ecuador = 

groupA = [['Нидерланды', '', 2, 1, 2], ['Сенегал', 0, '', 2, 3], ['Эквадор', 1, 1, '', 2], ['Катар', 0, 1, 0, '']]
groupB = [['Англия', '', 0, 6, 3], ['США', 0, '', 1, 1], ['Иран', 2, 0, '', 2], ['Уэльс', 0, 1, 0, '']]
groupC = [['Аргентина', '', 2, 2, 1], ['Польша', 0, '', 0, 2], ['Мексика', 0, 0, '', 2], ['Саудовская Аравия', 2, 0, 1, '']]
groupD = [['Франция', '', 4, 0, 2], ['Австрия', 1, '', 1, 1], ['Тунис', 1, 0, '', 0], ['Дания', 1, 0, 0, '']]
groupE = [['Япония', '', 2, 2, 0], ['Испания', 1, '', 1, 7], ['Германия', 1, 1, '', 4], ['Коста-Рика', 1, 0, 2, '']]
groupF = [['Марокко', '', 0, 2, 2], ['Хорватия', 0, '', 0, 4], ['Бельгия', 0, 0, '', 1], ['Канада', 1, 1, 0, '']]
groupG = [['Бразилия', '', 1, 0, 2], ['Швейцария', 0, '', 1, 3], ['Камерун', 1, 0, '', 3], ['Сербия', 0, 2, 3, '']]
groupH = [['Португалия', '', 1, 2, 3], ['Южная Корея', 2, '', 0, 2], ['Уругвай', 0, 0, '', 2], ['Гана', 2, 3, 0, '']]




# print(len(groupA))

# a = input(f'Выберите матч: \n1. {groupA}  \n \n \n \n ')

for i in range(3):
    print(f'{groupA[i][0]} - {groupA[len(groupA) - 4 + i][0]}')
    print(f'{groupA[i][0]} - {groupA[len(groupA) - 4 + i][0]}')
    print(f'{groupA[i][0]} - {groupA[len(groupA) - 4 + i][0]}')

